ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/****************  Bit definition for DDRCTRL_INIT5 register  *****************/
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos (0U)
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Msk (0x3FFU << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos) /*!< 0x000003FF */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024     DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Msk             /*!< Maximum duration of the auto initialization, tINIT5. Present only in designs configured to support LPDDR2/LPDDR3. */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_0   (0x1U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)   /*!< 0x00000001 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_1   (0x2U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)   /*!< 0x00000002 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_2   (0x4U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)   /*!< 0x00000004 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_3   (0x8U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)   /*!< 0x00000008 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_4   (0x10U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)  /*!< 0x00000010 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_5   (0x20U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)  /*!< 0x00000020 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_6   (0x40U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)  /*!< 0x00000040 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_7   (0x80U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos)  /*!< 0x00000080 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_8   (0x100U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos) /*!< 0x00000100 */
#define DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_9   (0x200U << DDRCTRL_INIT5_MAX_AUTO_INIT_X1024_Pos) /*!< 0x00000200 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos      (16U)
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_Msk      (0xFFU << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)       /*!< 0x00FF0000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32          DDRCTRL_INIT5_DEV_ZQINIT_X32_Msk                  /*!< ZQ initial calibration, tZQINIT. Present only in designs configured to support DDR3 or DDR4 or LPDDR2/LPDDR3. */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_0        (0x1U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)        /*!< 0x00010000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_1        (0x2U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)        /*!< 0x00020000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_2        (0x4U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)        /*!< 0x00040000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_3        (0x8U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)        /*!< 0x00080000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_4        (0x10U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)       /*!< 0x00100000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_5        (0x20U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)       /*!< 0x00200000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_6        (0x40U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)       /*!< 0x00400000 */
#define DDRCTRL_INIT5_DEV_ZQINIT_X32_7        (0x80U << DDRCTRL_INIT5_DEV_ZQINIT_X32_Pos)       /*!< 0x00800000 */

/***************  Bit definition for DDRCTRL_DIMMCTL register  ****************/
#define DDRCTRL_DIMMCTL_DIMM_STAGGER_CS_EN_Pos (0U)
#define DDRCTRL_DIMMCTL_DIMM_STAGGER_CS_EN_Msk (0x1U << DDRCTRL_DIMMCTL_DIMM_STAGGER_CS_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_DIMMCTL_DIMM_STAGGER_CS_EN     DDRCTRL_DIMMCTL_DIMM_STAGGER_CS_EN_Msk           /*!< Staggering enable for multi-rank accesses (for multi-rank UDIMM, RDIMM and LRDIMM implementations only). This is not supported for mDDR, LPDDR2, LPDDR3 or LPDDR4 SDRAMs. */
#define DDRCTRL_DIMMCTL_DIMM_ADDR_MIRR_EN_Pos  (1U)
#define DDRCTRL_DIMMCTL_DIMM_ADDR_MIRR_EN_Msk  (0x1U << DDRCTRL_DIMMCTL_DIMM_ADDR_MIRR_EN_Pos)  /*!< 0x00000002 */
#define DDRCTRL_DIMMCTL_DIMM_ADDR_MIRR_EN      DDRCTRL_DIMMCTL_DIMM_ADDR_MIRR_EN_Msk            /*!< Address Mirroring Enable (for multi-rank UDIMM implementations and multi-rank DDR4 RDIMM/LRDIMM implementations). */

/***************  Bit definition for DDRCTRL_DRAMTMG0 register  ***************/
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos (0U)
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_Msk (0x3FU << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos) /*!< 0x0000003F */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN     DDRCTRL_DRAMTMG0_T_RAS_MIN_Msk            /*!< tRAS(min): Minimum time between activate and precharge to the same bank. */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_0   (0x1U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_1   (0x2U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos)  /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_2   (0x4U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos)  /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_3   (0x8U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos)  /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_4   (0x10U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos) /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG0_T_RAS_MIN_5   (0x20U << DDRCTRL_DRAMTMG0_T_RAS_MIN_Pos) /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos (8U)
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_Msk (0x7FU << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos) /*!< 0x00007F00 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX     DDRCTRL_DRAMTMG0_T_RAS_MAX_Msk            /*!< tRAS(max): Maximum time between activate and precharge to same bank. This is the maximum time that a page can be kept open */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_0   (0x1U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_1   (0x2U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_2   (0x4U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_3   (0x8U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_4   (0x10U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos) /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_5   (0x20U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos) /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG0_T_RAS_MAX_6   (0x40U << DDRCTRL_DRAMTMG0_T_RAS_MAX_Pos) /*!< 0x00004000 */
#define DDRCTRL_DRAMTMG0_T_FAW_Pos     (16U)
#define DDRCTRL_DRAMTMG0_T_FAW_Msk     (0x3FU << DDRCTRL_DRAMTMG0_T_FAW_Pos)     /*!< 0x003F0000 */
#define DDRCTRL_DRAMTMG0_T_FAW         DDRCTRL_DRAMTMG0_T_FAW_Msk                /*!< tFAW Valid only when 8 or more banks(or banks x bank groups) are present. */
#define DDRCTRL_DRAMTMG0_T_FAW_0       (0x1U << DDRCTRL_DRAMTMG0_T_FAW_Pos)      /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG0_T_FAW_1       (0x2U << DDRCTRL_DRAMTMG0_T_FAW_Pos)      /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG0_T_FAW_2       (0x4U << DDRCTRL_DRAMTMG0_T_FAW_Pos)      /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG0_T_FAW_3       (0x8U << DDRCTRL_DRAMTMG0_T_FAW_Pos)      /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG0_T_FAW_4       (0x10U << DDRCTRL_DRAMTMG0_T_FAW_Pos)     /*!< 0x00100000 */
#define DDRCTRL_DRAMTMG0_T_FAW_5       (0x20U << DDRCTRL_DRAMTMG0_T_FAW_Pos)     /*!< 0x00200000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_Pos    (24U)
#define DDRCTRL_DRAMTMG0_WR2PRE_Msk    (0x7FU << DDRCTRL_DRAMTMG0_WR2PRE_Pos)    /*!< 0x7F000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE        DDRCTRL_DRAMTMG0_WR2PRE_Msk               /*!< Minimum time between write and precharge to same bank. */
#define DDRCTRL_DRAMTMG0_WR2PRE_0      (0x1U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)     /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_1      (0x2U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)     /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_2      (0x4U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)     /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_3      (0x8U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)     /*!< 0x08000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_4      (0x10U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)    /*!< 0x10000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_5      (0x20U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)    /*!< 0x20000000 */
#define DDRCTRL_DRAMTMG0_WR2PRE_6      (0x40U << DDRCTRL_DRAMTMG0_WR2PRE_Pos)    /*!< 0x40000000 */

/***************  Bit definition for DDRCTRL_DRAMTMG1 register  ***************/
#define DDRCTRL_DRAMTMG1_T_RC_Pos   (0U)
#define DDRCTRL_DRAMTMG1_T_RC_Msk   (0x7FU << DDRCTRL_DRAMTMG1_T_RC_Pos)   /*!< 0x0000007F */
#define DDRCTRL_DRAMTMG1_T_RC       DDRCTRL_DRAMTMG1_T_RC_Msk              /*!< tRC: Minimum time between activates to same bank. */
#define DDRCTRL_DRAMTMG1_T_RC_0     (0x1U << DDRCTRL_DRAMTMG1_T_RC_Pos)    /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG1_T_RC_1     (0x2U << DDRCTRL_DRAMTMG1_T_RC_Pos)    /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG1_T_RC_2     (0x4U << DDRCTRL_DRAMTMG1_T_RC_Pos)    /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG1_T_RC_3     (0x8U << DDRCTRL_DRAMTMG1_T_RC_Pos)    /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG1_T_RC_4     (0x10U << DDRCTRL_DRAMTMG1_T_RC_Pos)   /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG1_T_RC_5     (0x20U << DDRCTRL_DRAMTMG1_T_RC_Pos)   /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG1_T_RC_6     (0x40U << DDRCTRL_DRAMTMG1_T_RC_Pos)   /*!< 0x00000040 */
#define DDRCTRL_DRAMTMG1_RD2PRE_Pos (8U)
#define DDRCTRL_DRAMTMG1_RD2PRE_Msk (0x3FU << DDRCTRL_DRAMTMG1_RD2PRE_Pos) /*!< 0x00003F00 */
#define DDRCTRL_DRAMTMG1_RD2PRE     DDRCTRL_DRAMTMG1_RD2PRE_Msk            /*!< tRTP: Minimum time from read to precharge of same bank. */
#define DDRCTRL_DRAMTMG1_RD2PRE_0   (0x1U << DDRCTRL_DRAMTMG1_RD2PRE_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG1_RD2PRE_1   (0x2U << DDRCTRL_DRAMTMG1_RD2PRE_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG1_RD2PRE_2   (0x4U << DDRCTRL_DRAMTMG1_RD2PRE_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG1_RD2PRE_3   (0x8U << DDRCTRL_DRAMTMG1_RD2PRE_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG1_RD2PRE_4   (0x10U << DDRCTRL_DRAMTMG1_RD2PRE_Pos) /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG1_RD2PRE_5   (0x20U << DDRCTRL_DRAMTMG1_RD2PRE_Pos) /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG1_T_XP_Pos   (16U)
#define DDRCTRL_DRAMTMG1_T_XP_Msk   (0x1FU << DDRCTRL_DRAMTMG1_T_XP_Pos)   /*!< 0x001F0000 */
#define DDRCTRL_DRAMTMG1_T_XP       DDRCTRL_DRAMTMG1_T_XP_Msk              /*!< tXP: Minimum time after power-down exit to any operation. For DDR3, this should be programmed to tXPDLL if slow powerdown exit is selected in MR0[12]. */
#define DDRCTRL_DRAMTMG1_T_XP_0     (0x1U << DDRCTRL_DRAMTMG1_T_XP_Pos)    /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG1_T_XP_1     (0x2U << DDRCTRL_DRAMTMG1_T_XP_Pos)    /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG1_T_XP_2     (0x4U << DDRCTRL_DRAMTMG1_T_XP_Pos)    /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG1_T_XP_3     (0x8U << DDRCTRL_DRAMTMG1_T_XP_Pos)    /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG1_T_XP_4     (0x10U << DDRCTRL_DRAMTMG1_T_XP_Pos)   /*!< 0x00100000 */

/***************  Bit definition for DDRCTRL_DRAMTMG2 register  ***************/
#define DDRCTRL_DRAMTMG2_WR2RD_Pos         (0U)
#define DDRCTRL_DRAMTMG2_WR2RD_Msk         (0x3FU << DDRCTRL_DRAMTMG2_WR2RD_Pos)         /*!< 0x0000003F */
#define DDRCTRL_DRAMTMG2_WR2RD             DDRCTRL_DRAMTMG2_WR2RD_Msk                    /*!< DDR4: CWL + PL + BL/2 + tWTR_L */
#define DDRCTRL_DRAMTMG2_WR2RD_0           (0x1U << DDRCTRL_DRAMTMG2_WR2RD_Pos)          /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG2_WR2RD_1           (0x2U << DDRCTRL_DRAMTMG2_WR2RD_Pos)          /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG2_WR2RD_2           (0x4U << DDRCTRL_DRAMTMG2_WR2RD_Pos)          /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG2_WR2RD_3           (0x8U << DDRCTRL_DRAMTMG2_WR2RD_Pos)          /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG2_WR2RD_4           (0x10U << DDRCTRL_DRAMTMG2_WR2RD_Pos)         /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG2_WR2RD_5           (0x20U << DDRCTRL_DRAMTMG2_WR2RD_Pos)         /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG2_RD2WR_Pos         (8U)
#define DDRCTRL_DRAMTMG2_RD2WR_Msk         (0x3FU << DDRCTRL_DRAMTMG2_RD2WR_Pos)         /*!< 0x00003F00 */
#define DDRCTRL_DRAMTMG2_RD2WR             DDRCTRL_DRAMTMG2_RD2WR_Msk                    /*!< DDR2/3/mDDR: RL + BL/2 + 2 - WL */
#define DDRCTRL_DRAMTMG2_RD2WR_0           (0x1U << DDRCTRL_DRAMTMG2_RD2WR_Pos)          /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG2_RD2WR_1           (0x2U << DDRCTRL_DRAMTMG2_RD2WR_Pos)          /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG2_RD2WR_2           (0x4U << DDRCTRL_DRAMTMG2_RD2WR_Pos)          /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG2_RD2WR_3           (0x8U << DDRCTRL_DRAMTMG2_RD2WR_Pos)          /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG2_RD2WR_4           (0x10U << DDRCTRL_DRAMTMG2_RD2WR_Pos)         /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG2_RD2WR_5           (0x20U << DDRCTRL_DRAMTMG2_RD2WR_Pos)         /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_Pos  (16U)
#define DDRCTRL_DRAMTMG2_READ_LATENCY_Msk  (0x3FU << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)  /*!< 0x003F0000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY      DDRCTRL_DRAMTMG2_READ_LATENCY_Msk             /*!< Set to RL */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_0    (0x1U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)   /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_1    (0x2U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)   /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_2    (0x4U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)   /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_3    (0x8U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)   /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_4    (0x10U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)  /*!< 0x00100000 */
#define DDRCTRL_DRAMTMG2_READ_LATENCY_5    (0x20U << DDRCTRL_DRAMTMG2_READ_LATENCY_Pos)  /*!< 0x00200000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos (24U)
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_Msk (0x3FU << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos) /*!< 0x3F000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY     DDRCTRL_DRAMTMG2_WRITE_LATENCY_Msk            /*!< Set to WL */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_0   (0x1U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_1   (0x2U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_2   (0x4U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_3   (0x8U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos)  /*!< 0x08000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_4   (0x10U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos) /*!< 0x10000000 */
#define DDRCTRL_DRAMTMG2_WRITE_LATENCY_5   (0x20U << DDRCTRL_DRAMTMG2_WRITE_LATENCY_Pos) /*!< 0x20000000 */

