ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/***************  Bit definition for DDRCTRL_DRAMTMG3 register  ***************/
#define DDRCTRL_DRAMTMG3_T_MOD_Pos (0U)
#define DDRCTRL_DRAMTMG3_T_MOD_Msk (0x3FFU << DDRCTRL_DRAMTMG3_T_MOD_Pos) /*!< 0x000003FF */
#define DDRCTRL_DRAMTMG3_T_MOD     DDRCTRL_DRAMTMG3_T_MOD_Msk             /*!< tMOD: Parameter used only in DDR3 and DDR4. Cycles between load mode command and following non-load mode command. */
#define DDRCTRL_DRAMTMG3_T_MOD_0   (0x1U << DDRCTRL_DRAMTMG3_T_MOD_Pos)   /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG3_T_MOD_1   (0x2U << DDRCTRL_DRAMTMG3_T_MOD_Pos)   /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG3_T_MOD_2   (0x4U << DDRCTRL_DRAMTMG3_T_MOD_Pos)   /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG3_T_MOD_3   (0x8U << DDRCTRL_DRAMTMG3_T_MOD_Pos)   /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG3_T_MOD_4   (0x10U << DDRCTRL_DRAMTMG3_T_MOD_Pos)  /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG3_T_MOD_5   (0x20U << DDRCTRL_DRAMTMG3_T_MOD_Pos)  /*!< 0x00000020 */
#define DDRCTRL_DRAMTMG3_T_MOD_6   (0x40U << DDRCTRL_DRAMTMG3_T_MOD_Pos)  /*!< 0x00000040 */
#define DDRCTRL_DRAMTMG3_T_MOD_7   (0x80U << DDRCTRL_DRAMTMG3_T_MOD_Pos)  /*!< 0x00000080 */
#define DDRCTRL_DRAMTMG3_T_MOD_8   (0x100U << DDRCTRL_DRAMTMG3_T_MOD_Pos) /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG3_T_MOD_9   (0x200U << DDRCTRL_DRAMTMG3_T_MOD_Pos) /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG3_T_MRD_Pos (12U)
#define DDRCTRL_DRAMTMG3_T_MRD_Msk (0x3FU << DDRCTRL_DRAMTMG3_T_MRD_Pos)  /*!< 0x0003F000 */
#define DDRCTRL_DRAMTMG3_T_MRD     DDRCTRL_DRAMTMG3_T_MRD_Msk             /*!< tMRD: Cycles to wait after a mode register write or read. Depending on the connected SDRAM, tMRD represents: */
#define DDRCTRL_DRAMTMG3_T_MRD_0   (0x1U << DDRCTRL_DRAMTMG3_T_MRD_Pos)   /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG3_T_MRD_1   (0x2U << DDRCTRL_DRAMTMG3_T_MRD_Pos)   /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG3_T_MRD_2   (0x4U << DDRCTRL_DRAMTMG3_T_MRD_Pos)   /*!< 0x00004000 */
#define DDRCTRL_DRAMTMG3_T_MRD_3   (0x8U << DDRCTRL_DRAMTMG3_T_MRD_Pos)   /*!< 0x00008000 */
#define DDRCTRL_DRAMTMG3_T_MRD_4   (0x10U << DDRCTRL_DRAMTMG3_T_MRD_Pos)  /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG3_T_MRD_5   (0x20U << DDRCTRL_DRAMTMG3_T_MRD_Pos)  /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG3_T_MRW_Pos (20U)
#define DDRCTRL_DRAMTMG3_T_MRW_Msk (0x3FFU << DDRCTRL_DRAMTMG3_T_MRW_Pos) /*!< 0x3FF00000 */
#define DDRCTRL_DRAMTMG3_T_MRW     DDRCTRL_DRAMTMG3_T_MRW_Msk             /*!< Time to wait after a mode register write or read (MRW or MRR). */
#define DDRCTRL_DRAMTMG3_T_MRW_0   (0x1U << DDRCTRL_DRAMTMG3_T_MRW_Pos)   /*!< 0x00100000 */
#define DDRCTRL_DRAMTMG3_T_MRW_1   (0x2U << DDRCTRL_DRAMTMG3_T_MRW_Pos)   /*!< 0x00200000 */
#define DDRCTRL_DRAMTMG3_T_MRW_2   (0x4U << DDRCTRL_DRAMTMG3_T_MRW_Pos)   /*!< 0x00400000 */
#define DDRCTRL_DRAMTMG3_T_MRW_3   (0x8U << DDRCTRL_DRAMTMG3_T_MRW_Pos)   /*!< 0x00800000 */
#define DDRCTRL_DRAMTMG3_T_MRW_4   (0x10U << DDRCTRL_DRAMTMG3_T_MRW_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG3_T_MRW_5   (0x20U << DDRCTRL_DRAMTMG3_T_MRW_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG3_T_MRW_6   (0x40U << DDRCTRL_DRAMTMG3_T_MRW_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG3_T_MRW_7   (0x80U << DDRCTRL_DRAMTMG3_T_MRW_Pos)  /*!< 0x08000000 */
#define DDRCTRL_DRAMTMG3_T_MRW_8   (0x100U << DDRCTRL_DRAMTMG3_T_MRW_Pos) /*!< 0x10000000 */
#define DDRCTRL_DRAMTMG3_T_MRW_9   (0x200U << DDRCTRL_DRAMTMG3_T_MRW_Pos) /*!< 0x20000000 */

/***************  Bit definition for DDRCTRL_DRAMTMG4 register  ***************/
#define DDRCTRL_DRAMTMG4_T_RP_Pos  (0U)
#define DDRCTRL_DRAMTMG4_T_RP_Msk  (0x1FU << DDRCTRL_DRAMTMG4_T_RP_Pos)  /*!< 0x0000001F */
#define DDRCTRL_DRAMTMG4_T_RP      DDRCTRL_DRAMTMG4_T_RP_Msk             /*!< tRP: Minimum time from precharge to activate of same bank. */
#define DDRCTRL_DRAMTMG4_T_RP_0    (0x1U << DDRCTRL_DRAMTMG4_T_RP_Pos)   /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG4_T_RP_1    (0x2U << DDRCTRL_DRAMTMG4_T_RP_Pos)   /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG4_T_RP_2    (0x4U << DDRCTRL_DRAMTMG4_T_RP_Pos)   /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG4_T_RP_3    (0x8U << DDRCTRL_DRAMTMG4_T_RP_Pos)   /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG4_T_RP_4    (0x10U << DDRCTRL_DRAMTMG4_T_RP_Pos)  /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG4_T_RRD_Pos (8U)
#define DDRCTRL_DRAMTMG4_T_RRD_Msk (0xFU << DDRCTRL_DRAMTMG4_T_RRD_Pos)  /*!< 0x00000F00 */
#define DDRCTRL_DRAMTMG4_T_RRD     DDRCTRL_DRAMTMG4_T_RRD_Msk            /*!< DDR4: tRRD_L: Minimum time between activates from bank "a" to bank "b" for same bank group. */
#define DDRCTRL_DRAMTMG4_T_RRD_0   (0x1U << DDRCTRL_DRAMTMG4_T_RRD_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG4_T_RRD_1   (0x2U << DDRCTRL_DRAMTMG4_T_RRD_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG4_T_RRD_2   (0x4U << DDRCTRL_DRAMTMG4_T_RRD_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG4_T_RRD_3   (0x8U << DDRCTRL_DRAMTMG4_T_RRD_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG4_T_CCD_Pos (16U)
#define DDRCTRL_DRAMTMG4_T_CCD_Msk (0xFU << DDRCTRL_DRAMTMG4_T_CCD_Pos)  /*!< 0x000F0000 */
#define DDRCTRL_DRAMTMG4_T_CCD     DDRCTRL_DRAMTMG4_T_CCD_Msk            /*!< DDR4: tCCD_L: This is the minimum time between two reads or two writes for same bank group. */
#define DDRCTRL_DRAMTMG4_T_CCD_0   (0x1U << DDRCTRL_DRAMTMG4_T_CCD_Pos)  /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG4_T_CCD_1   (0x2U << DDRCTRL_DRAMTMG4_T_CCD_Pos)  /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG4_T_CCD_2   (0x4U << DDRCTRL_DRAMTMG4_T_CCD_Pos)  /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG4_T_CCD_3   (0x8U << DDRCTRL_DRAMTMG4_T_CCD_Pos)  /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG4_T_RCD_Pos (24U)
#define DDRCTRL_DRAMTMG4_T_RCD_Msk (0x1FU << DDRCTRL_DRAMTMG4_T_RCD_Pos) /*!< 0x1F000000 */
#define DDRCTRL_DRAMTMG4_T_RCD     DDRCTRL_DRAMTMG4_T_RCD_Msk            /*!< tRCD - tAL: Minimum time from activate to read or write command to same bank. */
#define DDRCTRL_DRAMTMG4_T_RCD_0   (0x1U << DDRCTRL_DRAMTMG4_T_RCD_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG4_T_RCD_1   (0x2U << DDRCTRL_DRAMTMG4_T_RCD_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG4_T_RCD_2   (0x4U << DDRCTRL_DRAMTMG4_T_RCD_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG4_T_RCD_3   (0x8U << DDRCTRL_DRAMTMG4_T_RCD_Pos)  /*!< 0x08000000 */
#define DDRCTRL_DRAMTMG4_T_RCD_4   (0x10U << DDRCTRL_DRAMTMG4_T_RCD_Pos) /*!< 0x10000000 */

/***************  Bit definition for DDRCTRL_DRAMTMG5 register  ***************/
#define DDRCTRL_DRAMTMG5_T_CKE_Pos   (0U)
#define DDRCTRL_DRAMTMG5_T_CKE_Msk   (0x1FU << DDRCTRL_DRAMTMG5_T_CKE_Pos)   /*!< 0x0000001F */
#define DDRCTRL_DRAMTMG5_T_CKE       DDRCTRL_DRAMTMG5_T_CKE_Msk              /*!< Minimum number of cycles of CKE HIGH/LOW during power-down and self refresh. */
#define DDRCTRL_DRAMTMG5_T_CKE_0     (0x1U << DDRCTRL_DRAMTMG5_T_CKE_Pos)    /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG5_T_CKE_1     (0x2U << DDRCTRL_DRAMTMG5_T_CKE_Pos)    /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG5_T_CKE_2     (0x4U << DDRCTRL_DRAMTMG5_T_CKE_Pos)    /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG5_T_CKE_3     (0x8U << DDRCTRL_DRAMTMG5_T_CKE_Pos)    /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG5_T_CKE_4     (0x10U << DDRCTRL_DRAMTMG5_T_CKE_Pos)   /*!< 0x00000010 */
#define DDRCTRL_DRAMTMG5_T_CKESR_Pos (8U)
#define DDRCTRL_DRAMTMG5_T_CKESR_Msk (0x3FU << DDRCTRL_DRAMTMG5_T_CKESR_Pos) /*!< 0x00003F00 */
#define DDRCTRL_DRAMTMG5_T_CKESR     DDRCTRL_DRAMTMG5_T_CKESR_Msk            /*!< Minimum CKE low width for Self refresh or Self refresh power down entry to exit timing in memory clock cycles. */
#define DDRCTRL_DRAMTMG5_T_CKESR_0   (0x1U << DDRCTRL_DRAMTMG5_T_CKESR_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DRAMTMG5_T_CKESR_1   (0x2U << DDRCTRL_DRAMTMG5_T_CKESR_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DRAMTMG5_T_CKESR_2   (0x4U << DDRCTRL_DRAMTMG5_T_CKESR_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DRAMTMG5_T_CKESR_3   (0x8U << DDRCTRL_DRAMTMG5_T_CKESR_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DRAMTMG5_T_CKESR_4   (0x10U << DDRCTRL_DRAMTMG5_T_CKESR_Pos) /*!< 0x00001000 */
#define DDRCTRL_DRAMTMG5_T_CKESR_5   (0x20U << DDRCTRL_DRAMTMG5_T_CKESR_Pos) /*!< 0x00002000 */
#define DDRCTRL_DRAMTMG5_T_CKSRE_Pos (16U)
#define DDRCTRL_DRAMTMG5_T_CKSRE_Msk (0xFU << DDRCTRL_DRAMTMG5_T_CKSRE_Pos)  /*!< 0x000F0000 */
#define DDRCTRL_DRAMTMG5_T_CKSRE     DDRCTRL_DRAMTMG5_T_CKSRE_Msk            /*!< This is the time after Self Refresh Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after SRE. */
#define DDRCTRL_DRAMTMG5_T_CKSRE_0   (0x1U << DDRCTRL_DRAMTMG5_T_CKSRE_Pos)  /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG5_T_CKSRE_1   (0x2U << DDRCTRL_DRAMTMG5_T_CKSRE_Pos)  /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG5_T_CKSRE_2   (0x4U << DDRCTRL_DRAMTMG5_T_CKSRE_Pos)  /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG5_T_CKSRE_3   (0x8U << DDRCTRL_DRAMTMG5_T_CKSRE_Pos)  /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG5_T_CKSRX_Pos (24U)
#define DDRCTRL_DRAMTMG5_T_CKSRX_Msk (0xFU << DDRCTRL_DRAMTMG5_T_CKSRX_Pos)       /*!< 0x0F000000 */
#define DDRCTRL_DRAMTMG5_T_CKSRX     DDRCTRL_DRAMTMG5_T_CKSRX_Msk            /*!< This is the time before Self Refresh Exit that CK is maintained as a valid clock before issuing SRX. Specifies the clock stable time before SRX. */
#define DDRCTRL_DRAMTMG5_T_CKSRX_0   (0x1U << DDRCTRL_DRAMTMG5_T_CKSRX_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG5_T_CKSRX_1   (0x2U << DDRCTRL_DRAMTMG5_T_CKSRX_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG5_T_CKSRX_2   (0x4U << DDRCTRL_DRAMTMG5_T_CKSRX_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG5_T_CKSRX_3   (0x8U << DDRCTRL_DRAMTMG5_T_CKSRX_Pos)  /*!< 0x08000000 */

/***************  Bit definition for DDRCTRL_DRAMTMG6 register  ***************/
#define DDRCTRL_DRAMTMG6_T_CKCSX_Pos  (0U)
#define DDRCTRL_DRAMTMG6_T_CKCSX_Msk  (0xFU << DDRCTRL_DRAMTMG6_T_CKCSX_Pos)  /*!< 0x0000000F */
#define DDRCTRL_DRAMTMG6_T_CKCSX      DDRCTRL_DRAMTMG6_T_CKCSX_Msk            /*!< This is the time before Clock Stop Exit that CK is maintained as a valid clock before issuing Clock Stop Exit. Specifies the clock stable time before next command after Clock Stop Exit. */
#define DDRCTRL_DRAMTMG6_T_CKCSX_0    (0x1U << DDRCTRL_DRAMTMG6_T_CKCSX_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DRAMTMG6_T_CKCSX_1    (0x2U << DDRCTRL_DRAMTMG6_T_CKCSX_Pos)  /*!< 0x00000002 */
#define DDRCTRL_DRAMTMG6_T_CKCSX_2    (0x4U << DDRCTRL_DRAMTMG6_T_CKCSX_Pos)  /*!< 0x00000004 */
#define DDRCTRL_DRAMTMG6_T_CKCSX_3    (0x8U << DDRCTRL_DRAMTMG6_T_CKCSX_Pos)  /*!< 0x00000008 */
#define DDRCTRL_DRAMTMG6_T_CKDPDX_Pos (16U)
#define DDRCTRL_DRAMTMG6_T_CKDPDX_Msk (0xFU << DDRCTRL_DRAMTMG6_T_CKDPDX_Pos) /*!< 0x000F0000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDX     DDRCTRL_DRAMTMG6_T_CKDPDX_Msk           /*!< This is the time before Deep Power Down Exit that CK is maintained as a valid clock before issuing DPDX. Specifies the clock stable time before DPDX. */
#define DDRCTRL_DRAMTMG6_T_CKDPDX_0   (0x1U << DDRCTRL_DRAMTMG6_T_CKDPDX_Pos) /*!< 0x00010000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDX_1   (0x2U << DDRCTRL_DRAMTMG6_T_CKDPDX_Pos) /*!< 0x00020000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDX_2   (0x4U << DDRCTRL_DRAMTMG6_T_CKDPDX_Pos) /*!< 0x00040000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDX_3   (0x8U << DDRCTRL_DRAMTMG6_T_CKDPDX_Pos) /*!< 0x00080000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDE_Pos (24U)
#define DDRCTRL_DRAMTMG6_T_CKDPDE_Msk (0xFU << DDRCTRL_DRAMTMG6_T_CKDPDE_Pos) /*!< 0x0F000000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDE     DDRCTRL_DRAMTMG6_T_CKDPDE_Msk           /*!< This is the time after Deep Power Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after DPDE. */
#define DDRCTRL_DRAMTMG6_T_CKDPDE_0   (0x1U << DDRCTRL_DRAMTMG6_T_CKDPDE_Pos) /*!< 0x01000000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDE_1   (0x2U << DDRCTRL_DRAMTMG6_T_CKDPDE_Pos) /*!< 0x02000000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDE_2   (0x4U << DDRCTRL_DRAMTMG6_T_CKDPDE_Pos) /*!< 0x04000000 */
#define DDRCTRL_DRAMTMG6_T_CKDPDE_3   (0x8U << DDRCTRL_DRAMTMG6_T_CKDPDE_Pos) /*!< 0x08000000 */

