ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/*****************  Bit definition for DDRPHYC_RIDR register  *****************/
#define DDRPHYC_RIDR_PUBMNR_Pos (0U)
#define DDRPHYC_RIDR_PUBMNR_Msk (0xFU << DDRPHYC_RIDR_PUBMNR_Pos) /*!< 0x0000000F */
#define DDRPHYC_RIDR_PUBMNR     DDRPHYC_RIDR_PUBMNR_Msk           /*!< PUB minor rev */
#define DDRPHYC_RIDR_PUBMNR_0   (0x1U << DDRPHYC_RIDR_PUBMNR_Pos) /*!< 0x00000001 */
#define DDRPHYC_RIDR_PUBMNR_1   (0x2U << DDRPHYC_RIDR_PUBMNR_Pos) /*!< 0x00000002 */
#define DDRPHYC_RIDR_PUBMNR_2   (0x4U << DDRPHYC_RIDR_PUBMNR_Pos) /*!< 0x00000004 */
#define DDRPHYC_RIDR_PUBMNR_3   (0x8U << DDRPHYC_RIDR_PUBMNR_Pos) /*!< 0x00000008 */
#define DDRPHYC_RIDR_PUBMDR_Pos (4U)
#define DDRPHYC_RIDR_PUBMDR_Msk (0xFU << DDRPHYC_RIDR_PUBMDR_Pos) /*!< 0x000000F0 */
#define DDRPHYC_RIDR_PUBMDR     DDRPHYC_RIDR_PUBMDR_Msk           /*!< PUB moderate rev */
#define DDRPHYC_RIDR_PUBMDR_0   (0x1U << DDRPHYC_RIDR_PUBMDR_Pos) /*!< 0x00000010 */
#define DDRPHYC_RIDR_PUBMDR_1   (0x2U << DDRPHYC_RIDR_PUBMDR_Pos) /*!< 0x00000020 */
#define DDRPHYC_RIDR_PUBMDR_2   (0x4U << DDRPHYC_RIDR_PUBMDR_Pos) /*!< 0x00000040 */
#define DDRPHYC_RIDR_PUBMDR_3   (0x8U << DDRPHYC_RIDR_PUBMDR_Pos) /*!< 0x00000080 */
#define DDRPHYC_RIDR_PUBMJR_Pos (8U)
#define DDRPHYC_RIDR_PUBMJR_Msk (0xFU << DDRPHYC_RIDR_PUBMJR_Pos) /*!< 0x00000F00 */
#define DDRPHYC_RIDR_PUBMJR     DDRPHYC_RIDR_PUBMJR_Msk           /*!< PUB maj rev */
#define DDRPHYC_RIDR_PUBMJR_0   (0x1U << DDRPHYC_RIDR_PUBMJR_Pos) /*!< 0x00000100 */
#define DDRPHYC_RIDR_PUBMJR_1   (0x2U << DDRPHYC_RIDR_PUBMJR_Pos) /*!< 0x00000200 */
#define DDRPHYC_RIDR_PUBMJR_2   (0x4U << DDRPHYC_RIDR_PUBMJR_Pos) /*!< 0x00000400 */
#define DDRPHYC_RIDR_PUBMJR_3   (0x8U << DDRPHYC_RIDR_PUBMJR_Pos) /*!< 0x00000800 */
#define DDRPHYC_RIDR_PHYMNR_Pos (12U)
#define DDRPHYC_RIDR_PHYMNR_Msk (0xFU << DDRPHYC_RIDR_PHYMNR_Pos) /*!< 0x0000F000 */
#define DDRPHYC_RIDR_PHYMNR     DDRPHYC_RIDR_PHYMNR_Msk           /*!< PHY minor rev */
#define DDRPHYC_RIDR_PHYMNR_0   (0x1U << DDRPHYC_RIDR_PHYMNR_Pos) /*!< 0x00001000 */
#define DDRPHYC_RIDR_PHYMNR_1   (0x2U << DDRPHYC_RIDR_PHYMNR_Pos) /*!< 0x00002000 */
#define DDRPHYC_RIDR_PHYMNR_2   (0x4U << DDRPHYC_RIDR_PHYMNR_Pos) /*!< 0x00004000 */
#define DDRPHYC_RIDR_PHYMNR_3   (0x8U << DDRPHYC_RIDR_PHYMNR_Pos) /*!< 0x00008000 */
#define DDRPHYC_RIDR_PHYMDR_Pos (16U)
#define DDRPHYC_RIDR_PHYMDR_Msk (0xFU << DDRPHYC_RIDR_PHYMDR_Pos) /*!< 0x000F0000 */
#define DDRPHYC_RIDR_PHYMDR     DDRPHYC_RIDR_PHYMDR_Msk           /*!< PHY moderate rev */
#define DDRPHYC_RIDR_PHYMDR_0   (0x1U << DDRPHYC_RIDR_PHYMDR_Pos) /*!< 0x00010000 */
#define DDRPHYC_RIDR_PHYMDR_1   (0x2U << DDRPHYC_RIDR_PHYMDR_Pos) /*!< 0x00020000 */
#define DDRPHYC_RIDR_PHYMDR_2   (0x4U << DDRPHYC_RIDR_PHYMDR_Pos) /*!< 0x00040000 */
#define DDRPHYC_RIDR_PHYMDR_3   (0x8U << DDRPHYC_RIDR_PHYMDR_Pos) /*!< 0x00080000 */
#define DDRPHYC_RIDR_PHYMJR_Pos (20U)
#define DDRPHYC_RIDR_PHYMJR_Msk (0xFU << DDRPHYC_RIDR_PHYMJR_Pos) /*!< 0x00F00000 */
#define DDRPHYC_RIDR_PHYMJR     DDRPHYC_RIDR_PHYMJR_Msk           /*!< PHY maj rev */
#define DDRPHYC_RIDR_PHYMJR_0   (0x1U << DDRPHYC_RIDR_PHYMJR_Pos) /*!< 0x00100000 */
#define DDRPHYC_RIDR_PHYMJR_1   (0x2U << DDRPHYC_RIDR_PHYMJR_Pos) /*!< 0x00200000 */
#define DDRPHYC_RIDR_PHYMJR_2   (0x4U << DDRPHYC_RIDR_PHYMJR_Pos) /*!< 0x00400000 */
#define DDRPHYC_RIDR_PHYMJR_3   (0x8U << DDRPHYC_RIDR_PHYMJR_Pos) /*!< 0x00800000 */
#define DDRPHYC_RIDR_UDRID_Pos  (24U)
#define DDRPHYC_RIDR_UDRID_Msk  (0xFFU << DDRPHYC_RIDR_UDRID_Pos) /*!< 0xFF000000 */
#define DDRPHYC_RIDR_UDRID      DDRPHYC_RIDR_UDRID_Msk            /*!< User-defined rev ID */
#define DDRPHYC_RIDR_UDRID_0    (0x1U << DDRPHYC_RIDR_UDRID_Pos)  /*!< 0x01000000 */
#define DDRPHYC_RIDR_UDRID_1    (0x2U << DDRPHYC_RIDR_UDRID_Pos)  /*!< 0x02000000 */
#define DDRPHYC_RIDR_UDRID_2    (0x4U << DDRPHYC_RIDR_UDRID_Pos)  /*!< 0x04000000 */
#define DDRPHYC_RIDR_UDRID_3    (0x8U << DDRPHYC_RIDR_UDRID_Pos)  /*!< 0x08000000 */
#define DDRPHYC_RIDR_UDRID_4    (0x10U << DDRPHYC_RIDR_UDRID_Pos) /*!< 0x10000000 */
#define DDRPHYC_RIDR_UDRID_5    (0x20U << DDRPHYC_RIDR_UDRID_Pos) /*!< 0x20000000 */
#define DDRPHYC_RIDR_UDRID_6    (0x40U << DDRPHYC_RIDR_UDRID_Pos) /*!< 0x40000000 */
#define DDRPHYC_RIDR_UDRID_7    (0x80U << DDRPHYC_RIDR_UDRID_Pos) /*!< 0x80000000 */

/*****************  Bit definition for DDRPHYC_PIR register  ******************/
#define DDRPHYC_PIR_INIT_Pos     (0U)
#define DDRPHYC_PIR_INIT_Msk     (0x1U << DDRPHYC_PIR_INIT_Pos)     /*!< 0x00000001 */
#define DDRPHYC_PIR_INIT         DDRPHYC_PIR_INIT_Msk               /*!< Initialization trigger */
#define DDRPHYC_PIR_DLLSRST_Pos  (1U)
#define DDRPHYC_PIR_DLLSRST_Msk  (0x1U << DDRPHYC_PIR_DLLSRST_Pos)  /*!< 0x00000002 */
#define DDRPHYC_PIR_DLLSRST      DDRPHYC_PIR_DLLSRST_Msk            /*!< DLL soft reset */
#define DDRPHYC_PIR_DLLLOCK_Pos  (2U)
#define DDRPHYC_PIR_DLLLOCK_Msk  (0x1U << DDRPHYC_PIR_DLLLOCK_Pos)  /*!< 0x00000004 */
#define DDRPHYC_PIR_DLLLOCK      DDRPHYC_PIR_DLLLOCK_Msk            /*!< DLL lock */
#define DDRPHYC_PIR_ZCAL_Pos     (3U)
#define DDRPHYC_PIR_ZCAL_Msk     (0x1U << DDRPHYC_PIR_ZCAL_Pos)     /*!< 0x00000008 */
#define DDRPHYC_PIR_ZCAL         DDRPHYC_PIR_ZCAL_Msk               /*!< Impedance calibration (Driver and ODT) */
#define DDRPHYC_PIR_ITMSRST_Pos  (4U)
#define DDRPHYC_PIR_ITMSRST_Msk  (0x1U << DDRPHYC_PIR_ITMSRST_Pos)  /*!< 0x00000010 */
#define DDRPHYC_PIR_ITMSRST      DDRPHYC_PIR_ITMSRST_Msk            /*!< ITM reset */
#define DDRPHYC_PIR_DRAMRST_Pos  (5U)
#define DDRPHYC_PIR_DRAMRST_Msk  (0x1U << DDRPHYC_PIR_DRAMRST_Pos)  /*!< 0x00000020 */
#define DDRPHYC_PIR_DRAMRST      DDRPHYC_PIR_DRAMRST_Msk            /*!< DRAM reset (DDR3 only) */
#define DDRPHYC_PIR_DRAMINIT_Pos (6U)
#define DDRPHYC_PIR_DRAMINIT_Msk (0x1U << DDRPHYC_PIR_DRAMINIT_Pos) /*!< 0x00000040 */
#define DDRPHYC_PIR_DRAMINIT     DDRPHYC_PIR_DRAMINIT_Msk           /*!< DRAM initialization */
#define DDRPHYC_PIR_QSTRN_Pos    (7U)
#define DDRPHYC_PIR_QSTRN_Msk    (0x1U << DDRPHYC_PIR_QSTRN_Pos)    /*!< 0x00000080 */
#define DDRPHYC_PIR_QSTRN        DDRPHYC_PIR_QSTRN_Msk              /*!< Read DQS training */
#define DDRPHYC_PIR_RVTRN_Pos    (8U)
#define DDRPHYC_PIR_RVTRN_Msk    (0x1U << DDRPHYC_PIR_RVTRN_Pos)    /*!< 0x00000100 */
#define DDRPHYC_PIR_RVTRN        DDRPHYC_PIR_RVTRN_Msk              /*!< Read DQS gate training DQSTRN) and RV training (RVTRN) should normally be run */
#define DDRPHYC_PIR_ICPC_Pos     (16U)
#define DDRPHYC_PIR_ICPC_Msk     (0x1U << DDRPHYC_PIR_ICPC_Pos)     /*!< 0x00010000 */
#define DDRPHYC_PIR_ICPC         DDRPHYC_PIR_ICPC_Msk               /*!< Initialization complete pin configuration */
#define DDRPHYC_PIR_DLLBYP_Pos   (17U)
#define DDRPHYC_PIR_DLLBYP_Msk   (0x1U << DDRPHYC_PIR_DLLBYP_Pos)   /*!< 0x00020000 */
#define DDRPHYC_PIR_DLLBYP       DDRPHYC_PIR_DLLBYP_Msk             /*!< DLL bypass */
#define DDRPHYC_PIR_CTLDINIT_Pos (18U)
#define DDRPHYC_PIR_CTLDINIT_Msk (0x1U << DDRPHYC_PIR_CTLDINIT_Pos) /*!< 0x00040000 */
#define DDRPHYC_PIR_CTLDINIT     DDRPHYC_PIR_CTLDINIT_Msk           /*!< Controller DRAM initialization */
#define DDRPHYC_PIR_CLRSR_Pos    (28U)
#define DDRPHYC_PIR_CLRSR_Msk    (0x1U << DDRPHYC_PIR_CLRSR_Pos)    /*!< 0x10000000 */
#define DDRPHYC_PIR_CLRSR        DDRPHYC_PIR_CLRSR_Msk              /*!< clear status register */
#define DDRPHYC_PIR_LOCKBYP_Pos  (29U)
#define DDRPHYC_PIR_LOCKBYP_Msk  (0x1U << DDRPHYC_PIR_LOCKBYP_Pos)  /*!< 0x20000000 */
#define DDRPHYC_PIR_LOCKBYP      DDRPHYC_PIR_LOCKBYP_Msk            /*!< DLL lock bypass */
#define DDRPHYC_PIR_ZCALBYP_Pos  (30U)
#define DDRPHYC_PIR_ZCALBYP_Msk  (0x1U << DDRPHYC_PIR_ZCALBYP_Pos)  /*!< 0x40000000 */
#define DDRPHYC_PIR_ZCALBYP      DDRPHYC_PIR_ZCALBYP_Msk            /*!< zcal bypass */
#define DDRPHYC_PIR_INITBYP_Pos  (31U)
#define DDRPHYC_PIR_INITBYP_Msk  (0x1U << DDRPHYC_PIR_INITBYP_Pos)  /*!< 0x80000000 */
#define DDRPHYC_PIR_INITBYP      DDRPHYC_PIR_INITBYP_Msk            /*!< Initialization bypass */

/*****************  Bit definition for DDRPHYC_PGCR register  *****************/
#define DDRPHYC_PGCR_ITMDMD_Pos  (0U)
#define DDRPHYC_PGCR_ITMDMD_Msk  (0x1U << DDRPHYC_PGCR_ITMDMD_Pos)  /*!< 0x00000001 */
#define DDRPHYC_PGCR_ITMDMD      DDRPHYC_PGCR_ITMDMD_Msk            /*!< ITM DDR mode */
#define DDRPHYC_PGCR_DQSCFG_Pos  (1U)
#define DDRPHYC_PGCR_DQSCFG_Msk  (0x1U << DDRPHYC_PGCR_DQSCFG_Pos)  /*!< 0x00000002 */
#define DDRPHYC_PGCR_DQSCFG      DDRPHYC_PGCR_DQSCFG_Msk            /*!< DQS gating configuration */
#define DDRPHYC_PGCR_DFTCMP_Pos  (2U)
#define DDRPHYC_PGCR_DFTCMP_Msk  (0x1U << DDRPHYC_PGCR_DFTCMP_Pos)  /*!< 0x00000004 */
#define DDRPHYC_PGCR_DFTCMP      DDRPHYC_PGCR_DFTCMP_Msk            /*!< DQS drift compensation */
#define DDRPHYC_PGCR_DFTLMT_Pos  (3U)
#define DDRPHYC_PGCR_DFTLMT_Msk  (0x3U << DDRPHYC_PGCR_DFTLMT_Pos)  /*!< 0x00000018 */
#define DDRPHYC_PGCR_DFTLMT      DDRPHYC_PGCR_DFTLMT_Msk            /*!< DQS drift limit */
#define DDRPHYC_PGCR_DFTLMT_0    (0x1U << DDRPHYC_PGCR_DFTLMT_Pos)  /*!< 0x00000008 */
#define DDRPHYC_PGCR_DFTLMT_1    (0x2U << DDRPHYC_PGCR_DFTLMT_Pos)  /*!< 0x00000010 */
#define DDRPHYC_PGCR_DTOSEL_Pos  (5U)
#define DDRPHYC_PGCR_DTOSEL_Msk  (0xFU << DDRPHYC_PGCR_DTOSEL_Pos)  /*!< 0x000001E0 */
#define DDRPHYC_PGCR_DTOSEL      DDRPHYC_PGCR_DTOSEL_Msk            /*!< Digital test output select */
#define DDRPHYC_PGCR_DTOSEL_0    (0x1U << DDRPHYC_PGCR_DTOSEL_Pos)  /*!< 0x00000020 */
#define DDRPHYC_PGCR_DTOSEL_1    (0x2U << DDRPHYC_PGCR_DTOSEL_Pos)  /*!< 0x00000040 */
#define DDRPHYC_PGCR_DTOSEL_2    (0x4U << DDRPHYC_PGCR_DTOSEL_Pos)  /*!< 0x00000080 */
#define DDRPHYC_PGCR_DTOSEL_3    (0x8U << DDRPHYC_PGCR_DTOSEL_Pos)  /*!< 0x00000100 */
#define DDRPHYC_PGCR_CKEN_Pos    (9U)
#define DDRPHYC_PGCR_CKEN_Msk    (0x7U << DDRPHYC_PGCR_CKEN_Pos)    /*!< 0x00000E00 */
#define DDRPHYC_PGCR_CKEN        DDRPHYC_PGCR_CKEN_Msk              /*!< CK enable */
#define DDRPHYC_PGCR_CKEN_0      (0x1U << DDRPHYC_PGCR_CKEN_Pos)    /*!< 0x00000200 */
#define DDRPHYC_PGCR_CKEN_1      (0x2U << DDRPHYC_PGCR_CKEN_Pos)    /*!< 0x00000400 */
#define DDRPHYC_PGCR_CKEN_2      (0x4U << DDRPHYC_PGCR_CKEN_Pos)    /*!< 0x00000800 */
#define DDRPHYC_PGCR_CKDV_Pos    (12U)
#define DDRPHYC_PGCR_CKDV_Msk    (0x3U << DDRPHYC_PGCR_CKDV_Pos)    /*!< 0x00003000 */
#define DDRPHYC_PGCR_CKDV        DDRPHYC_PGCR_CKDV_Msk              /*!< CK disable value */
#define DDRPHYC_PGCR_CKDV_0      (0x1U << DDRPHYC_PGCR_CKDV_Pos)    /*!< 0x00001000 */
#define DDRPHYC_PGCR_CKDV_1      (0x2U << DDRPHYC_PGCR_CKDV_Pos)    /*!< 0x00002000 */
#define DDRPHYC_PGCR_CKINV_Pos   (14U)
#define DDRPHYC_PGCR_CKINV_Msk   (0x1U << DDRPHYC_PGCR_CKINV_Pos)   /*!< 0x00004000 */
#define DDRPHYC_PGCR_CKINV       DDRPHYC_PGCR_CKINV_Msk             /*!< CK invert */
#define DDRPHYC_PGCR_IOLB_Pos    (15U)
#define DDRPHYC_PGCR_IOLB_Msk    (0x1U << DDRPHYC_PGCR_IOLB_Pos)    /*!< 0x00008000 */
#define DDRPHYC_PGCR_IOLB        DDRPHYC_PGCR_IOLB_Msk              /*!< I/O loop back select */
#define DDRPHYC_PGCR_IODDRM_Pos  (16U)
#define DDRPHYC_PGCR_IODDRM_Msk  (0x3U << DDRPHYC_PGCR_IODDRM_Pos)  /*!< 0x00030000 */
#define DDRPHYC_PGCR_IODDRM      DDRPHYC_PGCR_IODDRM_Msk            /*!< I/O DDR mode */
#define DDRPHYC_PGCR_IODDRM_0    (0x1U << DDRPHYC_PGCR_IODDRM_Pos)  /*!< 0x00010000 */
#define DDRPHYC_PGCR_IODDRM_1    (0x2U << DDRPHYC_PGCR_IODDRM_Pos)  /*!< 0x00020000 */
#define DDRPHYC_PGCR_RANKEN_Pos  (18U)
#define DDRPHYC_PGCR_RANKEN_Msk  (0xFU << DDRPHYC_PGCR_RANKEN_Pos)  /*!< 0x003C0000 */
#define DDRPHYC_PGCR_RANKEN      DDRPHYC_PGCR_RANKEN_Msk            /*!< Rank enable */
#define DDRPHYC_PGCR_RANKEN_0    (0x1U << DDRPHYC_PGCR_RANKEN_Pos)  /*!< 0x00040000 */
#define DDRPHYC_PGCR_RANKEN_1    (0x2U << DDRPHYC_PGCR_RANKEN_Pos)  /*!< 0x00080000 */
#define DDRPHYC_PGCR_RANKEN_2    (0x4U << DDRPHYC_PGCR_RANKEN_Pos)  /*!< 0x00100000 */
#define DDRPHYC_PGCR_RANKEN_3    (0x8U << DDRPHYC_PGCR_RANKEN_Pos)  /*!< 0x00200000 */
#define DDRPHYC_PGCR_ZKSEL_Pos   (22U)
#define DDRPHYC_PGCR_ZKSEL_Msk   (0x3U << DDRPHYC_PGCR_ZKSEL_Pos)   /*!< 0x00C00000 */
#define DDRPHYC_PGCR_ZKSEL       DDRPHYC_PGCR_ZKSEL_Msk             /*!< Impedance clock divider selection */
#define DDRPHYC_PGCR_ZKSEL_0     (0x1U << DDRPHYC_PGCR_ZKSEL_Pos)   /*!< 0x00400000 */
#define DDRPHYC_PGCR_ZKSEL_1     (0x2U << DDRPHYC_PGCR_ZKSEL_Pos)   /*!< 0x00800000 */
#define DDRPHYC_PGCR_PDDISDX_Pos (24U)
#define DDRPHYC_PGCR_PDDISDX_Msk (0x1U << DDRPHYC_PGCR_PDDISDX_Pos) /*!< 0x01000000 */
#define DDRPHYC_PGCR_PDDISDX     DDRPHYC_PGCR_PDDISDX_Msk           /*!< Power down disabled byte */
#define DDRPHYC_PGCR_RFSHDT_Pos  (25U)
#define DDRPHYC_PGCR_RFSHDT_Msk  (0xFU << DDRPHYC_PGCR_RFSHDT_Pos)  /*!< 0x1E000000 */
#define DDRPHYC_PGCR_RFSHDT      DDRPHYC_PGCR_RFSHDT_Msk            /*!< Refresh during training */
#define DDRPHYC_PGCR_RFSHDT_0    (0x1U << DDRPHYC_PGCR_RFSHDT_Pos)  /*!< 0x02000000 */
#define DDRPHYC_PGCR_RFSHDT_1    (0x2U << DDRPHYC_PGCR_RFSHDT_Pos)  /*!< 0x04000000 */
#define DDRPHYC_PGCR_RFSHDT_2    (0x4U << DDRPHYC_PGCR_RFSHDT_Pos)  /*!< 0x08000000 */
#define DDRPHYC_PGCR_RFSHDT_3    (0x8U << DDRPHYC_PGCR_RFSHDT_Pos)  /*!< 0x10000000 */
#define DDRPHYC_PGCR_LBDQSS_Pos  (29U)
#define DDRPHYC_PGCR_LBDQSS_Msk  (0x1U << DDRPHYC_PGCR_LBDQSS_Pos)  /*!< 0x20000000 */
#define DDRPHYC_PGCR_LBDQSS      DDRPHYC_PGCR_LBDQSS_Msk            /*!< Loop back DQS shift */
#define DDRPHYC_PGCR_LBGDQS_Pos  (30U)
#define DDRPHYC_PGCR_LBGDQS_Msk  (0x1U << DDRPHYC_PGCR_LBGDQS_Pos)  /*!< 0x40000000 */
#define DDRPHYC_PGCR_LBGDQS      DDRPHYC_PGCR_LBGDQS_Msk            /*!< Loop back DQS gating */
#define DDRPHYC_PGCR_LBMODE_Pos  (31U)
#define DDRPHYC_PGCR_LBMODE_Msk  (0x1U << DDRPHYC_PGCR_LBMODE_Pos)  /*!< 0x80000000 */
#define DDRPHYC_PGCR_LBMODE      DDRPHYC_PGCR_LBMODE_Msk            /*!< Loop back mode */

/*****************  Bit definition for DDRPHYC_PGSR register  *****************/
#define DDRPHYC_PGSR_IDONE_Pos   (0U)
#define DDRPHYC_PGSR_IDONE_Msk   (0x1U << DDRPHYC_PGSR_IDONE_Pos)   /*!< 0x00000001 */
#define DDRPHYC_PGSR_IDONE       DDRPHYC_PGSR_IDONE_Msk             /*!< Initialization done */
#define DDRPHYC_PGSR_DLDONE_Pos  (1U)
#define DDRPHYC_PGSR_DLDONE_Msk  (0x1U << DDRPHYC_PGSR_DLDONE_Pos)  /*!< 0x00000002 */
#define DDRPHYC_PGSR_DLDONE      DDRPHYC_PGSR_DLDONE_Msk            /*!< DLL lock done */
#define DDRPHYC_PGSR_ZCDDONE_Pos (2U)
#define DDRPHYC_PGSR_ZCDDONE_Msk (0x1U << DDRPHYC_PGSR_ZCDDONE_Pos) /*!< 0x00000004 */
#define DDRPHYC_PGSR_ZCDDONE     DDRPHYC_PGSR_ZCDDONE_Msk           /*!< zcal done */
#define DDRPHYC_PGSR_DIDONE_Pos  (3U)
#define DDRPHYC_PGSR_DIDONE_Msk  (0x1U << DDRPHYC_PGSR_DIDONE_Pos)  /*!< 0x00000008 */
#define DDRPHYC_PGSR_DIDONE      DDRPHYC_PGSR_DIDONE_Msk            /*!< DRAM initialization done */
#define DDRPHYC_PGSR_DTDONE_Pos  (4U)
#define DDRPHYC_PGSR_DTDONE_Msk  (0x1U << DDRPHYC_PGSR_DTDONE_Pos)  /*!< 0x00000010 */
#define DDRPHYC_PGSR_DTDONE      DDRPHYC_PGSR_DTDONE_Msk            /*!< Data training done */
#define DDRPHYC_PGSR_DTERR_Pos   (5U)
#define DDRPHYC_PGSR_DTERR_Msk   (0x1U << DDRPHYC_PGSR_DTERR_Pos)   /*!< 0x00000020 */
#define DDRPHYC_PGSR_DTERR       DDRPHYC_PGSR_DTERR_Msk             /*!< DQS gate training error */
#define DDRPHYC_PGSR_DTIERR_Pos  (6U)
#define DDRPHYC_PGSR_DTIERR_Msk  (0x1U << DDRPHYC_PGSR_DTIERR_Pos)  /*!< 0x00000040 */
#define DDRPHYC_PGSR_DTIERR      DDRPHYC_PGSR_DTIERR_Msk            /*!< DQS gate training intermittent error */
#define DDRPHYC_PGSR_DFTERR_Pos  (7U)
#define DDRPHYC_PGSR_DFTERR_Msk  (0x1U << DDRPHYC_PGSR_DFTERR_Pos)  /*!< 0x00000080 */
#define DDRPHYC_PGSR_DFTERR      DDRPHYC_PGSR_DFTERR_Msk            /*!< DQS drift error */
#define DDRPHYC_PGSR_RVERR_Pos   (8U)
#define DDRPHYC_PGSR_RVERR_Msk   (0x1U << DDRPHYC_PGSR_RVERR_Pos)   /*!< 0x00000100 */
#define DDRPHYC_PGSR_RVERR       DDRPHYC_PGSR_RVERR_Msk             /*!< Read valid training error */
#define DDRPHYC_PGSR_RVEIRR_Pos  (9U)
#define DDRPHYC_PGSR_RVEIRR_Msk  (0x1U << DDRPHYC_PGSR_RVEIRR_Pos)  /*!< 0x00000200 */
#define DDRPHYC_PGSR_RVEIRR      DDRPHYC_PGSR_RVEIRR_Msk            /*!< Read valid training intermittent error */
#define DDRPHYC_PGSR_TQ_Pos      (31U)
#define DDRPHYC_PGSR_TQ_Msk      (0x1U << DDRPHYC_PGSR_TQ_Pos)      /*!< 0x80000000 */
#define DDRPHYC_PGSR_TQ          DDRPHYC_PGSR_TQ_Msk                /*!< Temperature output (LPDDR only) N/A */

