ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/***************  Bit definition for RCC_AHB5RSTSETR register  ****************/
#define RCC_AHB5RSTSETR_GPIOZRST_Pos              (0U)
#define RCC_AHB5RSTSETR_GPIOZRST_Msk              (0x1U << RCC_AHB5RSTSETR_GPIOZRST_Pos)             /*!< 0x00000001 */
#define RCC_AHB5RSTSETR_GPIOZRST                  RCC_AHB5RSTSETR_GPIOZRST_Msk                       /*!< GPIOZ secure block reset */
#define RCC_AHB5RSTSETR_CRYP1RST_Pos              (4U)
#define RCC_AHB5RSTSETR_CRYP1RST_Msk              (0x1U << RCC_AHB5RSTSETR_CRYP1RST_Pos)             /*!< 0x00000010 */
#define RCC_AHB5RSTSETR_CRYP1RST                  RCC_AHB5RSTSETR_CRYP1RST_Msk                       /*!< CRYP1 (3DES/AES1) block reset */
#define RCC_AHB5RSTSETR_HASH1RST_Pos              (5U)
#define RCC_AHB5RSTSETR_HASH1RST_Msk              (0x1U << RCC_AHB5RSTSETR_HASH1RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB5RSTSETR_HASH1RST                  RCC_AHB5RSTSETR_HASH1RST_Msk                       /*!< HASH1 block reset */
#define RCC_AHB5RSTSETR_RNG1RST_Pos               (6U)
#define RCC_AHB5RSTSETR_RNG1RST_Msk               (0x1U << RCC_AHB5RSTSETR_RNG1RST_Pos)              /*!< 0x00000040 */
#define RCC_AHB5RSTSETR_RNG1RST                   RCC_AHB5RSTSETR_RNG1RST_Msk                        /*!< RNG1 block reset */
#define RCC_AHB5RSTSETR_AXIMCRST_Pos              (16U)
#define RCC_AHB5RSTSETR_AXIMCRST_Msk              (0x1U << RCC_AHB5RSTSETR_AXIMCRST_Pos)             /*!< 0x00010000 */
#define RCC_AHB5RSTSETR_AXIMCRST                  RCC_AHB5RSTSETR_AXIMCRST_Msk                       /*!< AXIMC block reset */

/***************  Bit definition for RCC_AHB5RSTCLRR register  ****************/
#define RCC_AHB5RSTCLRR_GPIOZRST_Pos              (0U)
#define RCC_AHB5RSTCLRR_GPIOZRST_Msk              (0x1U << RCC_AHB5RSTCLRR_GPIOZRST_Pos)             /*!< 0x00000001 */
#define RCC_AHB5RSTCLRR_GPIOZRST                  RCC_AHB5RSTCLRR_GPIOZRST_Msk                       /*!< GPIOZ secure block reset */
#define RCC_AHB5RSTCLRR_CRYP1RST_Pos              (4U)
#define RCC_AHB5RSTCLRR_CRYP1RST_Msk              (0x1U << RCC_AHB5RSTCLRR_CRYP1RST_Pos)             /*!< 0x00000010 */
#define RCC_AHB5RSTCLRR_CRYP1RST                  RCC_AHB5RSTCLRR_CRYP1RST_Msk                       /*!< CRYP1 (3DES/AES1) block reset */
#define RCC_AHB5RSTCLRR_HASH1RST_Pos              (5U)
#define RCC_AHB5RSTCLRR_HASH1RST_Msk              (0x1U << RCC_AHB5RSTCLRR_HASH1RST_Pos)             /*!< 0x00000020 */
#define RCC_AHB5RSTCLRR_HASH1RST                  RCC_AHB5RSTCLRR_HASH1RST_Msk                       /*!< HASH1 block reset */
#define RCC_AHB5RSTCLRR_RNG1RST_Pos               (6U)
#define RCC_AHB5RSTCLRR_RNG1RST_Msk               (0x1U << RCC_AHB5RSTCLRR_RNG1RST_Pos)              /*!< 0x00000040 */
#define RCC_AHB5RSTCLRR_RNG1RST                   RCC_AHB5RSTCLRR_RNG1RST_Msk                        /*!< RNG1 block reset */
#define RCC_AHB5RSTCLRR_AXIMCRST_Pos              (16U)
#define RCC_AHB5RSTCLRR_AXIMCRST_Msk              (0x1U << RCC_AHB5RSTCLRR_AXIMCRST_Pos)             /*!< 0x00010000 */
#define RCC_AHB5RSTCLRR_AXIMCRST                  RCC_AHB5RSTCLRR_AXIMCRST_Msk                       /*!< AXIMC block reset */

/***************  Bit definition for RCC_AHB6RSTSETR register  ****************/
#define RCC_AHB6RSTSETR_GPURST_Pos                (5U)
#define RCC_AHB6RSTSETR_GPURST_Msk                (0x1U << RCC_AHB6RSTSETR_GPURST_Pos)               /*!< 0x00000020 */
#define RCC_AHB6RSTSETR_GPURST                    RCC_AHB6RSTSETR_GPURST_Msk                         /*!< GPU block reset */
#define RCC_AHB6RSTSETR_ETHMACRST_Pos             (10U)
#define RCC_AHB6RSTSETR_ETHMACRST_Msk             (0x1U << RCC_AHB6RSTSETR_ETHMACRST_Pos)            /*!< 0x00000400 */
#define RCC_AHB6RSTSETR_ETHMACRST                 RCC_AHB6RSTSETR_ETHMACRST_Msk                      /*!< ETH block reset */
#define RCC_AHB6RSTSETR_FMCRST_Pos                (12U)
#define RCC_AHB6RSTSETR_FMCRST_Msk                (0x1U << RCC_AHB6RSTSETR_FMCRST_Pos)               /*!< 0x00001000 */
#define RCC_AHB6RSTSETR_FMCRST                    RCC_AHB6RSTSETR_FMCRST_Msk                         /*!< FMC block reset */
#define RCC_AHB6RSTSETR_QSPIRST_Pos               (14U)
#define RCC_AHB6RSTSETR_QSPIRST_Msk               (0x1U << RCC_AHB6RSTSETR_QSPIRST_Pos)              /*!< 0x00004000 */
#define RCC_AHB6RSTSETR_QSPIRST                   RCC_AHB6RSTSETR_QSPIRST_Msk                        /*!< QUADSPI and the QUADSPI delay block reset */
#define RCC_AHB6RSTSETR_SDMMC1RST_Pos             (16U)
#define RCC_AHB6RSTSETR_SDMMC1RST_Msk             (0x1U << RCC_AHB6RSTSETR_SDMMC1RST_Pos)            /*!< 0x00010000 */
#define RCC_AHB6RSTSETR_SDMMC1RST                 RCC_AHB6RSTSETR_SDMMC1RST_Msk                      /*!< SDMMC1 and the SDMMC1 delay (DLYBSD1) block reset */
#define RCC_AHB6RSTSETR_SDMMC2RST_Pos             (17U)
#define RCC_AHB6RSTSETR_SDMMC2RST_Msk             (0x1U << RCC_AHB6RSTSETR_SDMMC2RST_Pos)            /*!< 0x00020000 */
#define RCC_AHB6RSTSETR_SDMMC2RST                 RCC_AHB6RSTSETR_SDMMC2RST_Msk                      /*!< SDMMC2 and the SDMMC2 delay (DLYBSD2) block reset */
#define RCC_AHB6RSTSETR_CRC1RST_Pos               (20U)
#define RCC_AHB6RSTSETR_CRC1RST_Msk               (0x1U << RCC_AHB6RSTSETR_CRC1RST_Pos)              /*!< 0x00100000 */
#define RCC_AHB6RSTSETR_CRC1RST                   RCC_AHB6RSTSETR_CRC1RST_Msk                        /*!< CRC1 block reset */
#define RCC_AHB6RSTSETR_USBHRST_Pos               (24U)
#define RCC_AHB6RSTSETR_USBHRST_Msk               (0x1U << RCC_AHB6RSTSETR_USBHRST_Pos)              /*!< 0x01000000 */
#define RCC_AHB6RSTSETR_USBHRST                   RCC_AHB6RSTSETR_USBHRST_Msk                        /*!< USBH block reset */

/***************  Bit definition for RCC_AHB6RSTCLRR register  ****************/
#define RCC_AHB6RSTCLRR_ETHMACRST_Pos             (10U)
#define RCC_AHB6RSTCLRR_ETHMACRST_Msk             (0x1U << RCC_AHB6RSTCLRR_ETHMACRST_Pos)            /*!< 0x00000400 */
#define RCC_AHB6RSTCLRR_ETHMACRST                 RCC_AHB6RSTCLRR_ETHMACRST_Msk                      /*!< ETH block reset */
#define RCC_AHB6RSTCLRR_FMCRST_Pos                (12U)
#define RCC_AHB6RSTCLRR_FMCRST_Msk                (0x1U << RCC_AHB6RSTCLRR_FMCRST_Pos)               /*!< 0x00001000 */
#define RCC_AHB6RSTCLRR_FMCRST                    RCC_AHB6RSTCLRR_FMCRST_Msk                         /*!< FMC block reset */
#define RCC_AHB6RSTCLRR_QSPIRST_Pos               (14U)
#define RCC_AHB6RSTCLRR_QSPIRST_Msk               (0x1U << RCC_AHB6RSTCLRR_QSPIRST_Pos)              /*!< 0x00004000 */
#define RCC_AHB6RSTCLRR_QSPIRST                   RCC_AHB6RSTCLRR_QSPIRST_Msk                        /*!< QUADSPI and the QUADSPI delay block reset */
#define RCC_AHB6RSTCLRR_SDMMC1RST_Pos             (16U)
#define RCC_AHB6RSTCLRR_SDMMC1RST_Msk             (0x1U << RCC_AHB6RSTCLRR_SDMMC1RST_Pos)            /*!< 0x00010000 */
#define RCC_AHB6RSTCLRR_SDMMC1RST                 RCC_AHB6RSTCLRR_SDMMC1RST_Msk                      /*!< SDMMC1 and the SDMMC1 delay (DLYBSD1) block reset */
#define RCC_AHB6RSTCLRR_SDMMC2RST_Pos             (17U)
#define RCC_AHB6RSTCLRR_SDMMC2RST_Msk             (0x1U << RCC_AHB6RSTCLRR_SDMMC2RST_Pos)            /*!< 0x00020000 */
#define RCC_AHB6RSTCLRR_SDMMC2RST                 RCC_AHB6RSTCLRR_SDMMC2RST_Msk                      /*!< SDMMC2 and the SDMMC2 delay (DLYBSD2) block reset */
#define RCC_AHB6RSTCLRR_CRC1RST_Pos               (20U)
#define RCC_AHB6RSTCLRR_CRC1RST_Msk               (0x1U << RCC_AHB6RSTCLRR_CRC1RST_Pos)              /*!< 0x00100000 */
#define RCC_AHB6RSTCLRR_CRC1RST                   RCC_AHB6RSTCLRR_CRC1RST_Msk                        /*!< CRC1 block reset */
#define RCC_AHB6RSTCLRR_USBHRST_Pos               (24U)
#define RCC_AHB6RSTCLRR_USBHRST_Msk               (0x1U << RCC_AHB6RSTCLRR_USBHRST_Pos)              /*!< 0x01000000 */
#define RCC_AHB6RSTCLRR_USBHRST                   RCC_AHB6RSTCLRR_USBHRST_Msk                        /*!< USBH block reset */

