ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/*****************  Bit definition for RCC_MP_CIFR register  ******************/
#define RCC_MP_CIFR_LSIRDYF_Pos                   (0U)
#define RCC_MP_CIFR_LSIRDYF_Msk                   (0x1U << RCC_MP_CIFR_LSIRDYF_Pos)                  /*!< 0x00000001 */
#define RCC_MP_CIFR_LSIRDYF                       RCC_MP_CIFR_LSIRDYF_Msk                            /*!< LSI ready Interrupt Flag */
#define RCC_MP_CIFR_LSERDYF_Pos                   (1U)
#define RCC_MP_CIFR_LSERDYF_Msk                   (0x1U << RCC_MP_CIFR_LSERDYF_Pos)                  /*!< 0x00000002 */
#define RCC_MP_CIFR_LSERDYF                       RCC_MP_CIFR_LSERDYF_Msk                            /*!< LSE ready Interrupt Flag */
#define RCC_MP_CIFR_HSIRDYF_Pos                   (2U)
#define RCC_MP_CIFR_HSIRDYF_Msk                   (0x1U << RCC_MP_CIFR_HSIRDYF_Pos)                  /*!< 0x00000004 */
#define RCC_MP_CIFR_HSIRDYF                       RCC_MP_CIFR_HSIRDYF_Msk                            /*!< HSI ready Interrupt Flag */
#define RCC_MP_CIFR_HSERDYF_Pos                   (3U)
#define RCC_MP_CIFR_HSERDYF_Msk                   (0x1U << RCC_MP_CIFR_HSERDYF_Pos)                  /*!< 0x00000008 */
#define RCC_MP_CIFR_HSERDYF                       RCC_MP_CIFR_HSERDYF_Msk                            /*!< HSE ready Interrupt Flag */
#define RCC_MP_CIFR_CSIRDYF_Pos                   (4U)
#define RCC_MP_CIFR_CSIRDYF_Msk                   (0x1U << RCC_MP_CIFR_CSIRDYF_Pos)                  /*!< 0x00000010 */
#define RCC_MP_CIFR_CSIRDYF                       RCC_MP_CIFR_CSIRDYF_Msk                            /*!< CSI ready Interrupt Flag */
#define RCC_MP_CIFR_PLL1DYF_Pos                   (8U)
#define RCC_MP_CIFR_PLL1DYF_Msk                   (0x1U << RCC_MP_CIFR_PLL1DYF_Pos)                  /*!< 0x00000100 */
#define RCC_MP_CIFR_PLL1DYF                       RCC_MP_CIFR_PLL1DYF_Msk                            /*!< PLL1 ready Interrupt Flag */
#define RCC_MP_CIFR_PLL2DYF_Pos                   (9U)
#define RCC_MP_CIFR_PLL2DYF_Msk                   (0x1U << RCC_MP_CIFR_PLL2DYF_Pos)                  /*!< 0x00000200 */
#define RCC_MP_CIFR_PLL2DYF                       RCC_MP_CIFR_PLL2DYF_Msk                            /*!< PLL2 ready Interrupt Flag */
#define RCC_MP_CIFR_PLL3DYF_Pos                   (10U)
#define RCC_MP_CIFR_PLL3DYF_Msk                   (0x1U << RCC_MP_CIFR_PLL3DYF_Pos)                  /*!< 0x00000400 */
#define RCC_MP_CIFR_PLL3DYF                       RCC_MP_CIFR_PLL3DYF_Msk                            /*!< PLL3 ready Interrupt Flag */
#define RCC_MP_CIFR_PLL4DYF_Pos                   (11U)
#define RCC_MP_CIFR_PLL4DYF_Msk                   (0x1U << RCC_MP_CIFR_PLL4DYF_Pos)                  /*!< 0x00000800 */
#define RCC_MP_CIFR_PLL4DYF                       RCC_MP_CIFR_PLL4DYF_Msk                            /*!< PLL4 ready Interrupt Flag */
#define RCC_MP_CIFR_LSECSSF_Pos                   (16U)
#define RCC_MP_CIFR_LSECSSF_Msk                   (0x1U << RCC_MP_CIFR_LSECSSF_Pos)                  /*!< 0x00010000 */
#define RCC_MP_CIFR_LSECSSF                       RCC_MP_CIFR_LSECSSF_Msk                            /*!< LSE clock security system Interrupt Flag */
#define RCC_MP_CIFR_WKUPF_Pos                     (20U)
#define RCC_MP_CIFR_WKUPF_Msk                     (0x1U << RCC_MP_CIFR_WKUPF_Pos)                    /*!< 0x00100000 */
#define RCC_MP_CIFR_WKUPF                         RCC_MP_CIFR_WKUPF_Msk                              /*!< Wake up from CStop Interrupt Flag */

/****************  Bit definition for RCC_PWRLPDLYCR register  ****************/
#define RCC_PWRLPDLYCR_PWRLP_DLY_Pos              (0U)
#define RCC_PWRLPDLYCR_PWRLP_DLY_Msk              (0x3FFFFFU << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)        /*!< 0x003FFFFF */
#define RCC_PWRLPDLYCR_PWRLP_DLY                  RCC_PWRLPDLYCR_PWRLP_DLY_Msk                       /*!< PWRLP_TEMPO value */
#define RCC_PWRLPDLYCR_PWRLP_DLY_0                (0x1U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000001 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_1                (0x2U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000002 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_2                (0x4U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000004 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_3                (0x8U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)             /*!< 0x00000008 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_4                (0x10U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000010 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_5                (0x20U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000020 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_6                (0x40U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000040 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_7                (0x80U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)            /*!< 0x00000080 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_8                (0x100U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00000100 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_9                (0x200U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00000200 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_10               (0x400U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00000400 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_11               (0x800U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)           /*!< 0x00000800 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_12               (0x1000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00001000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_13               (0x2000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00002000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_14               (0x4000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00004000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_15               (0x8000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)          /*!< 0x00008000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_16               (0x10000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00010000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_17               (0x20000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00020000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_18               (0x40000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00040000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_19               (0x80000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)         /*!< 0x00080000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_20               (0x100000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)        /*!< 0x00100000 */
#define RCC_PWRLPDLYCR_PWRLP_DLY_21               (0x200000U << RCC_PWRLPDLYCR_PWRLP_DLY_Pos)        /*!< 0x00200000 */
#define RCC_PWRLPDLYCR_MCTMPSKP_Pos               (24U)
#define RCC_PWRLPDLYCR_MCTMPSKP_Msk               (0x1U << RCC_PWRLPDLYCR_MCTMPSKP_Pos)              /*!< 0x01000000 */
#define RCC_PWRLPDLYCR_MCTMPSKP                   RCC_PWRLPDLYCR_MCTMPSKP_Msk                        /*!< Skip the PWR_DLY for MCU */

/***************  Bit definition for RCC_MP_RSTSSETR register  ****************/
#define RCC_MP_RSTSSETR_PORRSTF_Pos               (0U)
#define RCC_MP_RSTSSETR_PORRSTF_Msk               (0x1U << RCC_MP_RSTSSETR_PORRSTF_Pos)              /*!< 0x00000001 */
#define RCC_MP_RSTSSETR_PORRSTF                   RCC_MP_RSTSSETR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_MP_RSTSSETR_BORRSTF_Pos               (1U)
#define RCC_MP_RSTSSETR_BORRSTF_Msk               (0x1U << RCC_MP_RSTSSETR_BORRSTF_Pos)              /*!< 0x00000002 */
#define RCC_MP_RSTSSETR_BORRSTF                   RCC_MP_RSTSSETR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_MP_RSTSSETR_PADRSTF_Pos               (2U)
#define RCC_MP_RSTSSETR_PADRSTF_Msk               (0x1U << RCC_MP_RSTSSETR_PADRSTF_Pos)              /*!< 0x00000004 */
#define RCC_MP_RSTSSETR_PADRSTF                   RCC_MP_RSTSSETR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_MP_RSTSSETR_HCSSRSTF_Pos              (3U)
#define RCC_MP_RSTSSETR_HCSSRSTF_Msk              (0x1U << RCC_MP_RSTSSETR_HCSSRSTF_Pos)             /*!< 0x00000008 */
#define RCC_MP_RSTSSETR_HCSSRSTF                  RCC_MP_RSTSSETR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_MP_RSTSSETR_VCORERSTF_Pos             (4U)
#define RCC_MP_RSTSSETR_VCORERSTF_Msk             (0x1U << RCC_MP_RSTSSETR_VCORERSTF_Pos)            /*!< 0x00000010 */
#define RCC_MP_RSTSSETR_VCORERSTF                 RCC_MP_RSTSSETR_VCORERSTF_Msk                      /*!< VDDCORE reset flag */
#define RCC_MP_RSTSSETR_MPSYSRSTF_Pos             (6U)
#define RCC_MP_RSTSSETR_MPSYSRSTF_Msk             (0x1U << RCC_MP_RSTSSETR_MPSYSRSTF_Pos)            /*!< 0x00000040 */
#define RCC_MP_RSTSSETR_MPSYSRSTF                 RCC_MP_RSTSSETR_MPSYSRSTF_Msk                      /*!< MPU System reset flag */
#define RCC_MP_RSTSSETR_MCSYSRSTF_Pos             (7U)
#define RCC_MP_RSTSSETR_MCSYSRSTF_Msk             (0x1U << RCC_MP_RSTSSETR_MCSYSRSTF_Pos)            /*!< 0x00000080 */
#define RCC_MP_RSTSSETR_MCSYSRSTF                 RCC_MP_RSTSSETR_MCSYSRSTF_Msk                      /*!< MCU System reset flag */
#define RCC_MP_RSTSSETR_IWDG1RSTF_Pos             (8U)
#define RCC_MP_RSTSSETR_IWDG1RSTF_Msk             (0x1U << RCC_MP_RSTSSETR_IWDG1RSTF_Pos)            /*!< 0x00000100 */
#define RCC_MP_RSTSSETR_IWDG1RSTF                 RCC_MP_RSTSSETR_IWDG1RSTF_Msk                      /*!< IWDG1 reset flag */
#define RCC_MP_RSTSSETR_IWDG2RSTF_Pos             (9U)
#define RCC_MP_RSTSSETR_IWDG2RSTF_Msk             (0x1U << RCC_MP_RSTSSETR_IWDG2RSTF_Pos)            /*!< 0x00000200 */
#define RCC_MP_RSTSSETR_IWDG2RSTF                 RCC_MP_RSTSSETR_IWDG2RSTF_Msk                      /*!< IWDG2 reset flag */
#define RCC_MP_RSTSSETR_STDBYRSTF_Pos             (11U)
#define RCC_MP_RSTSSETR_STDBYRSTF_Msk             (0x1U << RCC_MP_RSTSSETR_STDBYRSTF_Pos)            /*!< 0x00000800 */
#define RCC_MP_RSTSSETR_STDBYRSTF                 RCC_MP_RSTSSETR_STDBYRSTF_Msk                      /*!< System Standby reset flag */
#define RCC_MP_RSTSSETR_CSTDBYRSTF_Pos            (12U)
#define RCC_MP_RSTSSETR_CSTDBYRSTF_Msk            (0x1U << RCC_MP_RSTSSETR_CSTDBYRSTF_Pos)           /*!< 0x00001000 */
#define RCC_MP_RSTSSETR_CSTDBYRSTF                RCC_MP_RSTSSETR_CSTDBYRSTF_Msk                     /*!< MPU CStandby reset flag */
#define RCC_MP_RSTSSETR_MPUP0RSTF_Pos             (13U)
#define RCC_MP_RSTSSETR_MPUP0RSTF_Msk             (0x1U << RCC_MP_RSTSSETR_MPUP0RSTF_Pos)            /*!< 0x00002000 */
#define RCC_MP_RSTSSETR_MPUP0RSTF                 RCC_MP_RSTSSETR_MPUP0RSTF_Msk                      /*!< MPU processor 0 reset flag */
#define RCC_MP_RSTSSETR_MPUP1RSTF_Pos             (14U)
#define RCC_MP_RSTSSETR_MPUP1RSTF_Msk             (0x1U << RCC_MP_RSTSSETR_MPUP1RSTF_Pos)            /*!< 0x00004000 */
#define RCC_MP_RSTSSETR_MPUP1RSTF                 RCC_MP_RSTSSETR_MPUP1RSTF_Msk                      /*!< MPU processor 1 reset flag */
#define RCC_MP_RSTSSETR_SPARE_Pos                 (15U)
#define RCC_MP_RSTSSETR_SPARE_Msk                 (0x1U << RCC_MP_RSTSSETR_SPARE_Pos)                /*!< 0x00008000 */
#define RCC_MP_RSTSSETR_SPARE                     RCC_MP_RSTSSETR_SPARE_Msk                          /*!< Spare bits */

/*****************  Bit definition for RCC_MCO1CFGR register  *****************/
#define RCC_MCO1CFGR_MCO1SEL_Pos                  (0U)
#define RCC_MCO1CFGR_MCO1SEL_Msk                  (0x7U << RCC_MCO1CFGR_MCO1SEL_Pos)                 /*!< 0x00000007 */
#define RCC_MCO1CFGR_MCO1SEL                      RCC_MCO1CFGR_MCO1SEL_Msk                           /*!< MCO1 clock output selection */
#define RCC_MCO1CFGR_MCO1SEL_0                    (0x1U << RCC_MCO1CFGR_MCO1SEL_Pos)                 /*!< 0x00000001 */
#define RCC_MCO1CFGR_MCO1SEL_1                    (0x2U << RCC_MCO1CFGR_MCO1SEL_Pos)                 /*!< 0x00000002 */
#define RCC_MCO1CFGR_MCO1SEL_2                    (0x4U << RCC_MCO1CFGR_MCO1SEL_Pos)                 /*!< 0x00000004 */
#define RCC_MCO1CFGR_MCO1DIV_Pos                  (4U)
#define RCC_MCO1CFGR_MCO1DIV_Msk                  (0xFU << RCC_MCO1CFGR_MCO1DIV_Pos)                 /*!< 0x000000F0 */
#define RCC_MCO1CFGR_MCO1DIV                      RCC_MCO1CFGR_MCO1DIV_Msk                           /*!< MCO1 prescaler */
#define RCC_MCO1CFGR_MCO1DIV_0                    (0x1U << RCC_MCO1CFGR_MCO1DIV_Pos)                /*!< 0x00000010 */
#define RCC_MCO1CFGR_MCO1DIV_1                    (0x2U << RCC_MCO1CFGR_MCO1DIV_Pos)                /*!< 0x00000020 */
#define RCC_MCO1CFGR_MCO1DIV_2                    (0x4U << RCC_MCO1CFGR_MCO1DIV_Pos)                /*!< 0x00000040 */
#define RCC_MCO1CFGR_MCO1DIV_3                    (0x8U << RCC_MCO1CFGR_MCO1DIV_Pos)                /*!< 0x00000080 */
#define RCC_MCO1CFGR_MCO1ON_Pos                   (12U)
#define RCC_MCO1CFGR_MCO1ON_Msk                   (0x1U << RCC_MCO1CFGR_MCO1ON_Pos)                  /*!< 0x00001000 */
#define RCC_MCO1CFGR_MCO1ON                       RCC_MCO1CFGR_MCO1ON_Msk                            /*!< Control of the MCO1 output */

/*****************  Bit definition for RCC_MCO2CFGR register  *****************/
#define RCC_MCO2CFGR_MCO2SEL_Pos                  (0U)
#define RCC_MCO2CFGR_MCO2SEL_Msk                  (0x7U << RCC_MCO2CFGR_MCO2SEL_Pos)                 /*!< 0x00000007 */
#define RCC_MCO2CFGR_MCO2SEL                      RCC_MCO2CFGR_MCO2SEL_Msk                           /*!< Micro-controller clock output 2 */
#define RCC_MCO2CFGR_MCO2SEL_0                    (0x1U << RCC_MCO2CFGR_MCO2SEL_Pos)                 /*!< 0x00000001 */
#define RCC_MCO2CFGR_MCO2SEL_1                    (0x2U << RCC_MCO2CFGR_MCO2SEL_Pos)                 /*!< 0x00000002 */
#define RCC_MCO2CFGR_MCO2SEL_2                    (0x4U << RCC_MCO2CFGR_MCO2SEL_Pos)                 /*!< 0x00000004 */
#define RCC_MCO2CFGR_MCO2DIV_Pos                  (4U)
#define RCC_MCO2CFGR_MCO2DIV_Msk                  (0xFU << RCC_MCO2CFGR_MCO2DIV_Pos)                 /*!< 0x000000F0 */
#define RCC_MCO2CFGR_MCO2DIV                      RCC_MCO2CFGR_MCO2DIV_Msk                           /*!< MCO2 prescaler */
#define RCC_MCO2CFGR_MCO2DIV_0                    (0x1U << RCC_MCO2CFGR_MCO2DIV_Pos)                /*!< 0x00000010 */
#define RCC_MCO2CFGR_MCO2DIV_1                    (0x2U << RCC_MCO2CFGR_MCO2DIV_Pos)                /*!< 0x00000020 */
#define RCC_MCO2CFGR_MCO2DIV_2                    (0x4U << RCC_MCO2CFGR_MCO2DIV_Pos)                /*!< 0x00000040 */
#define RCC_MCO2CFGR_MCO2DIV_3                    (0x8U << RCC_MCO2CFGR_MCO2DIV_Pos)                /*!< 0x00000080 */
#define RCC_MCO2CFGR_MCO2ON_Pos                   (12U)
#define RCC_MCO2CFGR_MCO2ON_Msk                   (0x1U << RCC_MCO2CFGR_MCO2ON_Pos)                  /*!< 0x00001000 */
#define RCC_MCO2CFGR_MCO2ON                       RCC_MCO2CFGR_MCO2ON_Msk                            /*!< Control of the MCO2 output */

