ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_ca7.h
/******************  Bit definition for RCC_OCRDYR register  ******************/
#define RCC_OCRDYR_HSIRDY_Pos                     (0U)
#define RCC_OCRDYR_HSIRDY_Msk                     (0x1U << RCC_OCRDYR_HSIRDY_Pos)                    /*!< 0x00000001 */
#define RCC_OCRDYR_HSIRDY                         RCC_OCRDYR_HSIRDY_Msk                              /*!< HSI clock ready flag */
#define RCC_OCRDYR_HSIDIVRDY_Pos                  (2U)
#define RCC_OCRDYR_HSIDIVRDY_Msk                  (0x1U << RCC_OCRDYR_HSIDIVRDY_Pos)                 /*!< 0x00000004 */
#define RCC_OCRDYR_HSIDIVRDY                      RCC_OCRDYR_HSIDIVRDY_Msk                           /*!< HSI divider ready flag */
#define RCC_OCRDYR_CSIRDY_Pos                     (4U)
#define RCC_OCRDYR_CSIRDY_Msk                     (0x1U << RCC_OCRDYR_CSIRDY_Pos)                    /*!< 0x00000010 */
#define RCC_OCRDYR_CSIRDY                         RCC_OCRDYR_CSIRDY_Msk                              /*!< CSI clock ready flag */
#define RCC_OCRDYR_HSERDY_Pos                     (8U)
#define RCC_OCRDYR_HSERDY_Msk                     (0x1U << RCC_OCRDYR_HSERDY_Pos)                    /*!< 0x00000100 */
#define RCC_OCRDYR_HSERDY                         RCC_OCRDYR_HSERDY_Msk                              /*!< HSE clock ready flag */
#define RCC_OCRDYR_MPUCKRDY_Pos                   (23U)
#define RCC_OCRDYR_MPUCKRDY_Msk                   (0x1U << RCC_OCRDYR_MPUCKRDY_Pos)                  /*!< 0x00800000 */
#define RCC_OCRDYR_MPUCKRDY                       RCC_OCRDYR_MPUCKRDY_Msk                            /*!< MPU clock ready flag */
#define RCC_OCRDYR_AXICKRDY_Pos                   (24U)
#define RCC_OCRDYR_AXICKRDY_Msk                   (0x1U << RCC_OCRDYR_AXICKRDY_Pos)                  /*!< 0x01000000 */
#define RCC_OCRDYR_AXICKRDY                       RCC_OCRDYR_AXICKRDY_Msk                            /*!< AXI sub-system clock ready flag */
#define RCC_OCRDYR_CKREST_Pos                     (25U)
#define RCC_OCRDYR_CKREST_Msk                     (0x1U << RCC_OCRDYR_CKREST_Pos)                    /*!< 0x02000000 */
#define RCC_OCRDYR_CKREST                         RCC_OCRDYR_CKREST_Msk                              /*!< Clock Restore State Machine Status */

/*****************  Bit definition for RCC_DBGCFGR register  ******************/
#define RCC_DBGCFGR_TRACEDIV_Pos                  (0U)
#define RCC_DBGCFGR_TRACEDIV_Msk                  (0x7U << RCC_DBGCFGR_TRACEDIV_Pos)                 /*!< 0x00000007 */
#define RCC_DBGCFGR_TRACEDIV                      RCC_DBGCFGR_TRACEDIV_Msk                           /*!< Clock divider for the trace clock (ck_trace) */
#define RCC_DBGCFGR_TRACEDIV_0                    (0x1U << RCC_DBGCFGR_TRACEDIV_Pos)                 /*!< 0x00000001 */
#define RCC_DBGCFGR_TRACEDIV_1                    (0x2U << RCC_DBGCFGR_TRACEDIV_Pos)                 /*!< 0x00000002 */
#define RCC_DBGCFGR_TRACEDIV_2                    (0x4U << RCC_DBGCFGR_TRACEDIV_Pos)                 /*!< 0x00000004 */
#define RCC_DBGCFGR_DBGCKEN_Pos                   (8U)
#define RCC_DBGCFGR_DBGCKEN_Msk                   (0x1U << RCC_DBGCFGR_DBGCKEN_Pos)                  /*!< 0x00000100 */
#define RCC_DBGCFGR_DBGCKEN                       RCC_DBGCFGR_DBGCKEN_Msk                            /*!< Clock enable for debug function */
#define RCC_DBGCFGR_TRACECKEN_Pos                 (9U)
#define RCC_DBGCFGR_TRACECKEN_Msk                 (0x1U << RCC_DBGCFGR_TRACECKEN_Pos)                /*!< 0x00000200 */
#define RCC_DBGCFGR_TRACECKEN                     RCC_DBGCFGR_TRACECKEN_Msk                          /*!< Clock enable for trace function */
#define RCC_DBGCFGR_DBGRST_Pos                    (12U)
#define RCC_DBGCFGR_DBGRST_Msk                    (0x1U << RCC_DBGCFGR_DBGRST_Pos)                   /*!< 0x00001000 */
#define RCC_DBGCFGR_DBGRST                        RCC_DBGCFGR_DBGRST_Msk                             /*!< Reset of the debug function */

/*****************  Bit definition for RCC_RCK3SELR register  *****************/
#define RCC_RCK3SELR_PLL3SRC_Pos                  (0U)
#define RCC_RCK3SELR_PLL3SRC_Msk                  (0x3U << RCC_RCK3SELR_PLL3SRC_Pos)                 /*!< 0x00000003 */
#define RCC_RCK3SELR_PLL3SRC                      RCC_RCK3SELR_PLL3SRC_Msk                           /*!< Reference clock selection for PLL3 */
#define RCC_RCK3SELR_PLL3SRC_0                    (0x1U << RCC_RCK3SELR_PLL3SRC_Pos)                 /*!< 0x00000001 */
#define RCC_RCK3SELR_PLL3SRC_1                    (0x2U << RCC_RCK3SELR_PLL3SRC_Pos)                 /*!< 0x00000002 */
#define RCC_RCK3SELR_PLL3SRCRDY_Pos               (31U)
#define RCC_RCK3SELR_PLL3SRCRDY_Msk               (0x1U << RCC_RCK3SELR_PLL3SRCRDY_Pos)              /*!< 0x80000000 */
#define RCC_RCK3SELR_PLL3SRCRDY                   RCC_RCK3SELR_PLL3SRCRDY_Msk                        /*!< PLL3 reference clock switch status */

/*****************  Bit definition for RCC_RCK4SELR register  *****************/
#define RCC_RCK4SELR_PLL4SRC_Pos                  (0U)
#define RCC_RCK4SELR_PLL4SRC_Msk                  (0x3U << RCC_RCK4SELR_PLL4SRC_Pos)                 /*!< 0x00000003 */
#define RCC_RCK4SELR_PLL4SRC                      RCC_RCK4SELR_PLL4SRC_Msk                           /*!< Reference clock selection for PLL4 */
#define RCC_RCK4SELR_PLL4SRC_0                    (0x1U << RCC_RCK4SELR_PLL4SRC_Pos)                 /*!< 0x00000001 */
#define RCC_RCK4SELR_PLL4SRC_1                    (0x2U << RCC_RCK4SELR_PLL4SRC_Pos)                 /*!< 0x00000002 */
#define RCC_RCK4SELR_PLL4SRCRDY_Pos               (31U)
#define RCC_RCK4SELR_PLL4SRCRDY_Msk               (0x1U << RCC_RCK4SELR_PLL4SRCRDY_Pos)              /*!< 0x80000000 */
#define RCC_RCK4SELR_PLL4SRCRDY                   RCC_RCK4SELR_PLL4SRCRDY_Msk                        /*!< PLL4 reference clock switch status */

/****************  Bit definition for RCC_TIMG1PRER register  *****************/
#define RCC_TIMG1PRER_TIMG1PRE_Pos                (0U)
#define RCC_TIMG1PRER_TIMG1PRE_Msk                (0x1U << RCC_TIMG1PRER_TIMG1PRE_Pos)               /*!< 0x00000001 */
#define RCC_TIMG1PRER_TIMG1PRE                    RCC_TIMG1PRER_TIMG1PRE_Msk                         /*!< Timers clocks prescaler selection */
#define RCC_TIMG1PRER_TIMG1PRERDY_Pos             (31U)
#define RCC_TIMG1PRER_TIMG1PRERDY_Msk             (0x1U << RCC_TIMG1PRER_TIMG1PRERDY_Pos)            /*!< 0x80000000 */
#define RCC_TIMG1PRER_TIMG1PRERDY                 RCC_TIMG1PRER_TIMG1PRERDY_Msk                      /*!< Timers clocks prescaler status */

